test/integration/helpers/fixtures/offline-payment-search.json

[
    {
        "scope": "https://api.railz.io:443",
        "method": "POST",
        "path": "/v1/recipients",
        "body": {
            "type": "individual",
            "firstName": "Tom",
            "lastName": "Jones",
            "email": "testEmail@example.com",
            "address": {
                "street1": "123 Wolfstrasse",
                "city": "Berlin",
                "country": "DE",
                "postalCode": "123123"
            }
        },
        "status": 200,
        "response": {
            "ok": true,
            "recipient": {
                "id": "R-F3SViPWxpjNzEV7V2VRMxY",
                "referenceId": "R-F3SViPWxpjNzEV7V2VRMxY",
                "parentRecipientId": null,
                "email": "testEmail@example.com",
                "name": "Tom Jones",
                "lastName": "Jones",
                "firstName": "Tom",
                "legalName": "",
                "type": "individual",
                "status": "incomplete",
                "language": "en",
                "complianceStatus": "pending",
                "dob": null,
                "passport": "",
                "placeOfBirth": null,
                "updatedAt": "2022-10-25T05:02:27.193Z",
                "createdAt": "2022-10-25T05:02:27.193Z",
                "tags": [],
                "isPortalUser": false,
                "taxDeliveryType": "mail",
                "contactEmails": [],
                "occupation": "",
                "address": {
                    "street1": "123 Wolfstrasse",
                    "street2": "",
                    "city": "Berlin",
                    "postalCode": "123123",
                    "country": "DE",
                    "region": null,
                    "phone": "",
                    "phoneValidated": false
                },
                "compliance": {
                    "status": "pending",
                    "checkedAt": null
                },
                "gravatarUrl": "https://www.gravatar.com/avatar/47891e3b30e9fe3c5355801d4cbd5896?d=404",
                "governmentId": null,
                "ssn": null,
                "governmentIds": [],
                "birthplace": {
                    "country": null,
                    "region": null,
                    "city": null
                },
                "citizenships": [],
                "routeType": "sepa",
                "routeMinimum": "0",
                "estimatedFees": "4",
                "accounts": [],
                "payoutMethod": null,
                "primaryCurrency": null,
                "riskScore": null,
                "merchantId": "M-W3mQuLjDafUGietRUqmeRz",
                "inactiveReasons": {
                    "primaryAccount": "missing"
                },
                "taxWithholdingPercentage": null,
                "taxForm": null,
                "taxFormStatus": null
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 25 Oct 2022 05:02:27 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1626",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "74",
            "X-Rate-Limit-Reset",
            "1666674207",
            "Vary",
            "Origin",
            "ETag",
            "W/\"65a-wapBvwxZiENFkvMfWnueuYpC/NU\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "POST",
        "path": "/v1/recipients/R-F3SViPWxpjNzEV7V2VRMxY/offlinePayments",
        "body": {
            "externalId": "testOfflinePayment",
            "taxReportable": false,
            "amount": "10.00",
            "currency": "USD",
            "withholdingAmount": "2.40",
            "withholdingCurrency": "USD"
        },
        "status": 200,
        "response": {
            "ok": true,
            "offlinePayment": {
                "id": "OP-Tuhogb5QDjAzcnJsDDQmdW",
                "recipientId": "R-F3SViPWxpjNzEV7V2VRMxY",
                "taxFormId": null,
                "entered": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "withholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "equivalentWithholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "amount": "10.00",
                "currency": "USD",
                "withholdingAmount": "2.40",
                "withholdingCurrency": "USD",
                "equivalentWithholdingAmount": "2.40",
                "equivalentWithholdingCurrency": "USD",
                "paymentId": null,
                "externalId": "testOfflinePayment",
                "memo": "",
                "payoutMethod": null,
                "tags": [],
                "taxReportable": false,
                "category": "services",
                "processedAt": "2022-10-25T05:02:27.578Z",
                "forceUsTaxActivity": false,
                "taxWithholdingReason": null,
                "equivalentUntaxedAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "modifiedSinceCreation": false,
                "taxPaidByWithholdingAgents": "0",
                "status": "processed",
                "enteredAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "updatedAt": "2022-10-25T05:02:27.578Z",
                "createdAt": "2022-10-25T05:02:27.578Z",
                "deletedAt": null
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 25 Oct 2022 05:02:27 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1255",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "73",
            "X-Rate-Limit-Reset",
            "1666674207",
            "Vary",
            "Origin",
            "ETag",
            "W/\"4e7-DGt1G7nF9RZ7B9kqkK+L3HNUxoA\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "POST",
        "path": "/v1/recipients/R-F3SViPWxpjNzEV7V2VRMxY/offlinePayments",
        "body": {
            "externalId": "otherOfflinePayment",
            "taxReportable": false,
            "amount": "10.00",
            "currency": "USD",
            "withholdingAmount": "2.40",
            "withholdingCurrency": "USD"
        },
        "status": 200,
        "response": {
            "ok": true,
            "offlinePayment": {
                "id": "OP-RgZtrCwxrXFXQJE7r2cxMy",
                "recipientId": "R-F3SViPWxpjNzEV7V2VRMxY",
                "taxFormId": null,
                "entered": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "withholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "equivalentWithholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "amount": "10.00",
                "currency": "USD",
                "withholdingAmount": "2.40",
                "withholdingCurrency": "USD",
                "equivalentWithholdingAmount": "2.40",
                "equivalentWithholdingCurrency": "USD",
                "paymentId": null,
                "externalId": "otherOfflinePayment",
                "memo": "",
                "payoutMethod": null,
                "tags": [],
                "taxReportable": false,
                "category": "services",
                "processedAt": "2022-10-25T05:02:27.897Z",
                "forceUsTaxActivity": false,
                "taxWithholdingReason": null,
                "equivalentUntaxedAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "modifiedSinceCreation": false,
                "taxPaidByWithholdingAgents": "0",
                "status": "processed",
                "enteredAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "updatedAt": "2022-10-25T05:02:27.897Z",
                "createdAt": "2022-10-25T05:02:27.897Z",
                "deletedAt": null
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 25 Oct 2022 05:02:27 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1256",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "72",
            "X-Rate-Limit-Reset",
            "1666674207",
            "Vary",
            "Origin",
            "ETag",
            "W/\"4e8-K0B4R9JZmClrThM/5+cHYK1xHtI\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "GET",
        "path": "/v1/recipients/R-F3SViPWxpjNzEV7V2VRMxY/offline-payments?recipientId=R-F3SViPWxpjNzEV7V2VRMxY&page=1&pageSize=10&search=",
        "body": "",
        "status": 200,
        "response": {
            "ok": true,
            "offlinePayments": [
                {
                    "id": "OP-RgZtrCwxrXFXQJE7r2cxMy",
                    "recipientId": "R-F3SViPWxpjNzEV7V2VRMxY",
                    "taxFormId": null,
                    "entered": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "withholding": {
                        "value": "2.40",
                        "currency": "USD"
                    },
                    "equivalentWithholding": {
                        "value": "2.40",
                        "currency": "USD"
                    },
                    "amount": "10.00",
                    "currency": "USD",
                    "withholdingAmount": "2.40",
                    "withholdingCurrency": "USD",
                    "equivalentWithholdingAmount": "2.40",
                    "equivalentWithholdingCurrency": "USD",
                    "paymentId": null,
                    "externalId": "otherOfflinePayment",
                    "memo": "",
                    "payoutMethod": null,
                    "tags": [],
                    "taxReportable": false,
                    "category": "services",
                    "processedAt": "2022-10-25T05:02:27.897Z",
                    "forceUsTaxActivity": false,
                    "taxWithholdingReason": null,
                    "equivalentUntaxedAmount": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "modifiedSinceCreation": false,
                    "taxPaidByWithholdingAgents": "0",
                    "status": "processed",
                    "enteredAmount": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "updatedAt": "2022-10-25T05:02:27.897Z",
                    "createdAt": "2022-10-25T05:02:27.897Z",
                    "deletedAt": null
                },
                {
                    "id": "OP-Tuhogb5QDjAzcnJsDDQmdW",
                    "recipientId": "R-F3SViPWxpjNzEV7V2VRMxY",
                    "taxFormId": null,
                    "entered": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "withholding": {
                        "value": "2.40",
                        "currency": "USD"
                    },
                    "equivalentWithholding": {
                        "value": "2.40",
                        "currency": "USD"
                    },
                    "amount": "10.00",
                    "currency": "USD",
                    "withholdingAmount": "2.40",
                    "withholdingCurrency": "USD",
                    "equivalentWithholdingAmount": "2.40",
                    "equivalentWithholdingCurrency": "USD",
                    "paymentId": null,
                    "externalId": "testOfflinePayment",
                    "memo": "",
                    "payoutMethod": null,
                    "tags": [],
                    "taxReportable": false,
                    "category": "services",
                    "processedAt": "2022-10-25T05:02:27.578Z",
                    "forceUsTaxActivity": false,
                    "taxWithholdingReason": null,
                    "equivalentUntaxedAmount": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "modifiedSinceCreation": false,
                    "taxPaidByWithholdingAgents": "0",
                    "status": "processed",
                    "enteredAmount": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "updatedAt": "2022-10-25T05:02:27.578Z",
                    "createdAt": "2022-10-25T05:02:27.578Z",
                    "deletedAt": null
                }
            ],
            "meta": {
                "page": 1,
                "pages": 1,
                "records": 2
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 25 Oct 2022 05:02:28 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "2739",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "71",
            "X-Rate-Limit-Reset",
            "1666674207",
            "Vary",
            "Origin",
            "ETag",
            "W/\"ab3-zTw/VupFa8DpbYWwbMb6k2adPRI\""
        ],
        "responseIsBinary": false
    }
]